---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRotateElement
source: html/d9711459-276b-db1d-3bd3-b28a76f6479b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotRotateElement Property

Can't rotate element into this position.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRotateElement { get; }
```